{
  "Salty": "A flavor profile from soy sauce, salt, or fermented seafood, providing depth and seasoning.",
  "Moderate seasoning": "A characteristic of Korean cuisine related to moderate seasoning, often described as korean-style, traditional, ingredients.",
  "Vegetables": "Fresh vegetables like cabbage, spinach, bean sprouts, and radish, essential in Korean meals.",
  "Red": "A reddish color, often from gochujang, gochugaru, or other red ingredients.",
  "Savory": "A rich, umami flavor profile from fermented ingredients like soy sauce, doenjang, or fish sauce.",
  "Bowl": "Served in a bowl, typically for soups, stews, or rice dishes.",
  "Stewed": "Slow-cooked in liquid, allowing flavors to meld and ingredients to become tender and flavorful.",
  "Fried": "Cooked in hot oil, creating a crispy, golden exterior while maintaining tender interior.",
  "Soup": "A liquid-based dish, often served as part of a meal, ranging from light broths to hearty stews.",
  "Crispy": "A texture characterized by a crunchy, brittle exterior, often achieved through frying or grilling.",
  "Simmered": "A characteristic of Korean cuisine related to simmered, often described as traditional, soup/stew, featuring.",
  "Stew": "A thick, hearty dish cooked slowly in liquid, with rich, concentrated flavors.",
  "Spicy": "A flavor profile characterized by Gochujang (red chili paste) or red pepper powder (gochugaru), creating a fiery, pungent heat that is a signature of Korean cuisine.",
  "Tender": "A soft, easily chewable texture, often from slow cooking or marination.",
  "Plate": "Served on a plate, typically for dry dishes or grilled items.",
  "Red spicy broth": "A characteristic of Korean cuisine related to red spicy broth, often described as traditional, soup/stew, featuring.",
  "Rice": "The staple grain of Korean cuisine, served with almost every meal, often sticky short-grain rice.",
  "Deep-fried": "A characteristic of Korean cuisine related to deep-fried, often described as crispy, fried, korean-style.",
  "Seafood": "Fresh fish, shrimp, squid, and other marine ingredients, common in coastal Korean cuisine.",
  "White rice": "A characteristic of Korean cuisine related to white rice, often described as rice-based, various, toppings,.",
  "Braised": "Slow-cooked in liquid, allowing flavors to meld and ingredients to become tender and flavorful.",
  "Kimchi": "Fermented vegetables, most commonly napa cabbage, seasoned with chili and garlic, a Korean staple.",
  "Sour": "A tangy flavor profile from vinegar, fermented foods, or citrus elements.",
  "Fermented": "Preserved through fermentation, developing complex, tangy flavors and beneficial probiotics.",
  "Marinated": "A characteristic of Korean cuisine related to marinated, often described as marinated, sauce, flavorful.",
  "Grilled": "Cooked over an open flame or on a grill, imparting a smoky, charred flavor and crispy texture.",
  "Beef": "A premium protein in Korean cooking, often marinated and grilled, or used in soups and stews.",
  "Pork": "A versatile meat used in Korean BBQ, stews, and various dishes, especially popular as pork belly.",
  "Noodle": "Various types including wheat, buckwheat, and sweet potato noodles, used in soups and stir-fries.",
  "Sesame seeds": "A characteristic of Korean cuisine related to sesame seeds, often described as sesame, traditional, side.",
  "Wheat noodles": "A characteristic of Korean cuisine related to wheat noodles, often described as featuring, flavorful, broth.",
  "Egg": "A characteristic of Korean cuisine related to egg, often described as korean-style, crispy, fried.",
  "Chicken": "A common poultry ingredient in Korean cuisine, used in soups, stews, grilled dishes, and fried preparations.",
  "Sweet": "A flavor profile featuring sweetness from sugar, honey, or fruits like pear, creating a balanced taste.",
  "Pan-fried": "A characteristic of Korean cuisine related to pan-fried, often described as savory, pancake, made.",
  "Tofu": "Soft or firm soybean curd, a protein-rich ingredient used in stews and side dishes.",
  "Pan": "A characteristic of Korean cuisine related to pan, often described as savory, pancake, made.",
  "Stir-fried": "Quickly cooked in a hot pan with oil, maintaining crisp textures and vibrant colors.",
  "Mild sweet": "A characteristic of Korean cuisine related to mild sweet, often described as sweet, sauce, beef.",
  "Steamed": "Cooked with steam, preserving natural flavors and nutrients while keeping ingredients moist.",
  "Egg garnish": "A characteristic of Korean cuisine related to egg garnish, often described as topped, egg,, vegetables,.",
  "Sautéed": "A characteristic of Korean cuisine related to sautéed, often described as made, spicy,, hearty.",
  "Boiled": "Cooked in boiling liquid, often used for soups and noodles, creating a clear, clean flavor.",
  "Rice porridge": "A characteristic of Korean cuisine related to rice porridge, often described as rice-based, various, toppings,."
}